In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import numpy as np
import pandas as pd

In [3]:
hiring_df = pd.read_csv("hiring.csv")

In [4]:
print(hiring_df)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
hiring_df.fillna(0)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    0.0                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
df_no_exp =hiring_df.drop(columns=['experience'])

In [7]:
df_no_exp.corr()

,test_score(out of 10),interview_score(out of 10),salary($)
test_score(out of 10),1.000000,0.143066,-0.003004
interview_score(out of 10),0.143066,1.000000,0.037820
salary($),-0.003004,0.037820,1.000000

In [8]:
exp_hiring_df=pd.get_dummies(hiring_df,dtype=int)

In [9]:
print(exp_hiring_df)

   test_score(out of 10)  interview_score(out of 10)  salary($)  \
0                    8.0                           9      50000
1                    8.0                           6      45000
2                    6.0                           7      60000
3                   10.0                          10      65000
4                    9.0                           6      70000
5                    7.0                          10      62000
6                    NaN                           7      72000
7                    7.0                           8      80000

   experience_eleven  experience_five  experience_seven  experience_ten  \
0                  0                0                 0               0
1                  0                0                 0               0
2                  0                1                 0               0
3                  0                0                 0               0
4                  0                0                 1               0
5                  0                0                 0               0
6                  0                0                 0               1
7                  1                0                 0               0

   experience_three  experience_two
0                 0               0
1                 0               0
2                 0               0
3                 0               1
4                 0               0
5                 1               0
6                 0               0
7                 0               0

In [10]:
exp_hiring_df=exp_hiring_df.fillna(0)

In [11]:
exp_hiring_df

,test_score(out of 10),interview_score(out of 10),salary($),experience_eleven,experience_five,experience_seven,experience_ten,experience_three,experience_two
0,8.0,9,50000,0,0,0,0,0,0
1,8.0,6,45000,0,0,0,0,0,0
2,6.0,7,60000,0,1,0,0,0,0
3,10.0,10,65000,0,0,0,0,0,1
4,9.0,6,70000,0,0,1,0,0,0
5,7.0,10,62000,0,0,0,0,1,0
6,0.0,7,72000,0,0,0,1,0,0
7,7.0,8,80000,1,0,0,0,0,0

In [12]:
x_total=exp_hiring_df.drop(columns=['salary($)'])
y_total=exp_hiring_df['salary($)']

In [13]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [14]:
model=LinearRegression()

In [15]:
x_train,x_test,y_train,y_test=train_test_split(x_total,y_total,test_size=0.15)

In [16]:
model.fit(x_train,y_train)

LinearRegression()

In [17]:
model.predict(x_test)

array([51211.26760563, 50605.63380282])

In [18]:
model.predict([[9.0,6.0,0,0,0,0,0,1]])

array([60605.63380282])

In [19]:
model.score(x_train,y_train)

1.0

In [20]:
test_score=int(input('enter your test score: '))
interview_score=int(input('enter your interview score: '))
experience_eleven=0
experience_five=0
experience_seven=0
experience_ten=0
experience_three=0
experience_two=0
exp_level=input()
if(exp_level=='experience_eleven'):
    experience_eleven=1
elif(exp_level=='experience_five'):
    experience_five=1
elif(exp_level=='experience_seven'):
    experience_seven=1
elif(exp_level=='experience_ten'):
    experience_ten=1
elif(exp_level=='experience_three'):
    experience_three=1
elif(exp_level=='experience_two'):
    experience_two=1

model.predict([[test_score,interview_score,experience_eleven,experience_five,experience_seven,experience_ten,experience_three,experience_two]])

enter your test score: i

ValueError: invalid literal for int() with base 10: 'i'

In [ ]:
from word2number import w2n
hiring_df['experience']=hiring_df['experience'].apply(w2n.word_to_num)

In [24]:
hiring_df['experience'].fillna(0,inplace=True)
hiring_df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000